doc/server/installation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>PBench server installation</title>
<!-- 2018-02-07 Wed 10:12 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="keywords" content="pbench" />
<link rel="stylesheet" href="../../stylesheets/normalize.css" type="text/css"/>
<link rel="stylesheet" href="../../stylesheets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" href="../../stylesheets/github-light.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">PBench server installation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Overview</a></li>
<li><a href="#sec-3">Prerequisites</a></li>
<li><a href="#sec-4">Server installation (generic)</a>
<ul>
<li><a href="#sec-4-1">Installing the RPM</a></li>
<li><a href="#sec-4-2">Customizing the installation with the local settings.</a></li>
<li><a href="#sec-4-3">Config files</a></li>
<li><a href="#sec-4-4">The rest of the setup</a></li>
</ul>
</li>
<li><a href="#sec-5">Testing</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Server installation is done through two packages: an externally
available, upstream package containing all the relevant scripts and an
internal package that contains the local configuration files<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>. The
upstream bits include a script that the internal package calls to
install the local config files in the appropriate places. It also
creates a crontab from the information in the configuration files
which needs to be installed manually and creates the top level
directories needed to store results.
</p>

<p>
The server RPM consists of the scripts that are run (currently from cron)
on the server side: they include scripts to check, unpack and archive the
incoming tarballs, reorganize the results hierarchy, index the results into
ElasticSearch, etc.
</p>

<p>
In addition to the generic bits, some localization is needed. This is
discussed in some detail below.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Overview</h2>
<div class="outline-text-2" id="text-2">
<p>
A user running the pbench agent produces results that are stored
locally, until the user calls <code>pbench-move-results</code>. The results are then
packaged up as a compressed tarball which is copied to the server.
Once there, the server scripts are run through <code>cron</code> to unpack
the tarball and store the results for later visualization. Additional
processing (which is not described in this document any further) might
include indexing results, creating backups of the tarballs, and sending
sosreports on to other services for further processing.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Prerequisites</h2>
<div class="outline-text-2" id="text-3">
<p>
The host that runs the server has to run apache. It should also
have a fairly hefty filesystem for storing results. Of course, the
more results you produce, the bigger the filesystem should be.
</p>

<p>
In our setup, we have a machine that runs apache and mounts a 27TB
gluster volume on /pbench. For experimental purposes, a filesystem
on a SATA/SAS disk with capacity of a few TB should be more than enough.
</p>

<p>
In addition, we index the results into ElasticSearch. This setup
is beyond the scope of this document.
</p>

<p>
If your local pbench admins provide an "internal" RPM available, you should use it
for installation: it takes care of the drudgery of installing the "external" RPM
and then customizing the installation with the local settings.
</p>

<p>
If there is no "internal" RPM available, install the "external" RPM (see <a href="#sec-4">here</a> for details).
You will then have to customize the installation by hand (see <a href="#sec-4-2">here</a> for details).
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Server installation (generic)</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">Installing the RPM</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The repo is the standard <a href="https://copr.fedorainfracloud.org/coprs/ndokos/pbench/">COPR pbench repo</a>, installed with
</p>
<pre class="example">
dnf copr enable ndokos/pbench
</pre>
<p>
or manually if dnf is not available - see the <a href="https://copr.fedorainfracloud.org/coprs/ndokos/pbench/">COPR pbench page</a> for instructions.
</p>

<p>
The server is installed normally:
</p>
<pre class="example">
dnf install pbench-server
# or
# yum install pbench-server
</pre>
<p>
That creates a <code>pbench</code> user with home directory <code>/home/pbench</code> if not
present already. The server bits can be installed anywhere, but the
default location is <code>/opt/pbench-server</code>: scripts under
<code>/opt/pbench-server/bin</code>, libraries, config files, crontabs under
<code>/opt/pbench-server/lib</code>.
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">Customizing the installation with the local settings.</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The home directory of the <code>pbench</code> user is only used for ssh purposes:
the public key of the <code>pbench agent</code> is copied in to allow <code>pbench-move-results</code>
to be able to copy tarballs to the server without requiring a password.
</p>

<p>
The installation directory (<code>/opt/pbench-server</code> by default) holds all
the scripts, config files and the crontab. There may be more than one
config file, depending on what services the server provides, but this
document only describes the basic setup of the server, for which the
config file is <code>/opt/pbench-server/lib/config/pbench-server.cfg</code>.
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">Config files</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Example config files are installed under <code>/opt/pbench-server/lib/config</code>. You should
make copies of these files:
</p>
<pre class="example">
cp pbench-server.cfg.example pbench-server.cfg
cp pbench-index.cfg.example pbench-index.cfg
</pre>
<p>
and modify them appropriately (<code>pbench-index.cfg</code> is optional - see
below). The minimal changes required are marked with <code># CHANGE ME</code>
comments: basically, hostnames and e-mail addresses will need to be
modified for your environment.
</p>

<p>
In addition, you will need to decide which roles and tasks to enable
under cron.  The default roles are <code>pbench-results</code> and
<code>pbench-backup</code>.
</p>

<p>
The <code>pbench-results</code> role consists of a number of tasks: unpacking
incoming tarballs (task <code>pbench-unpack-tarballs</code>), copying sosreports
(task <code>pbench-copy-sosreports</code>), indexing metadata (and real-soon-now
results) into ElasticSearch (task <code>pbench-index</code>) and reorganizing
results on user demand (task <code>pbench-edit-prefixes</code>). The minimal set
is unpacking the tarballs and reorganizing results. The rest are
optional and not covered in this document. In particular, if you don't
run the <code>pbench-index</code> task, you don't need to worry about the
<code>pbench-index.cfg</code> file above.
</p>

<p>
The <code>pbench-backup</code> role consists of two tasks: actually backing up the
tarballs (task <code>pbench-backup-tarballs</code>) and verifying the integrity
of the tarballs (task <code>pbench-verify-tarballs</code>).
</p>

<p>
You might want to save the config file(s) in some safe place for future
reference. If you need to reinstall the <code>pbench-server</code> RPM, you can
then just generate the rest of the setup from the saved config file
as described in the next section.
</p>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4">The rest of the setup</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Let us assume you now have a saved <code>pbench-server.cfg</code> file in some
safe place. The rest of the setup goes as follows:
</p>
<pre class="example">
PATH=/opt/pbench-server/bin:$PATH
pbench-server-config-activate /path/to/saved/pbench-server.cfg
pbench-server-activate /opt/pbench-server/lib/config/pbench-server.cfg
</pre>
<p>
The first script copies the config file(s) to the standard place
<code>/opt/pbench-server/lib/config/</code>. N.B. the name <code>pbench-server.cfg</code> is
fixed: there <b>must</b> be a file of that name in
<code>/opt/pbench-server/lib/config/</code> at the end of this step and it is
<b>the</b> config file that is used in the second step, and is made
available to the cron jobs.
</p>

<p>
The second step consists of a number of substeps:
</p>
<ul class="org-ul">
<li>Create the crontab, based on the roles and tasks defined in the
config file. The crontab is <b>not</b> activated: you should examine it
carefully and, assuming that it passes muster, activate it (see below).
</li>
<li>Create the results host info structure that the agent depends on to
send results to the server.
</li>
<li>Create a directory structure to store results, by default under
<code>/pbench</code>. It is up to you to make sure that there is enough space
there for the results that will be generated by your users.
</li>
</ul>

<p>
The final step is to manually activate the crontab (as user <code>pbench</code>,
<b>not</b> as root):
</p>
<pre class="example">
su - pbench
crontab /opt/pbench-server/lib/crontab/crontab
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Testing</h2>
<div class="outline-text-2" id="text-5">
<p>
You should then test the whole shebang by setting up a <code>pbench-agent</code>
(see <a href="../agent/installation.html">PBench agent installation</a>), running a simple benchmark and moving
the results to the server (see the <a href="../agent/user-guide.html">PBench agent user guide</a> for
details).  Watch the log files on the server (<code>/pbench/logs</code> and
subdirs thereof by default) to make sure that all stages of processing
are correctly done.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
Although this document describes installation in terms of an "internal"
package, note that that may be a convenient fiction. If there <b>is</b> one available,
then installing it should take care of the config files and the rest of the setup
described in <a href="#sec-4">Server installation (generic)</a>.
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Page updated: 2018-02-07 Wed 10:12</p>
</div>
</body>
</html>
